!pip install rasgoql --upgrade

!pip install psycopg2-binary --force-reinstall --no-cache-dir

In [12]:
import rasgoql

creds = rasgoql.PostgresCredentials(username='myuser', password='', host='127.0.0.1', port=5432, database='olist', schema='public')

rql = rasgoql.connect(creds)

### **Frequency of orders delivered every month**

In [25]:
ds = rql.dataset('OLIST.PUBLIC.ORDERS')

delivered = ds.filter(filter_statements=["order_status = 'delivered'"])

delivered = delivered.datepart(dates={'order_delivered_customer':'year'})
delivered = delivered.datepart(dates={'order_delivered_customer':'month'})

agg = delivered.aggregate(group_by=['order_delivered_customer_year','order_delivered_customer_month'],
                          aggregations={'order_id':['COUNT']})

agg.preview()

,order_delivered_customer_year,order_delivered_customer_month,order_id_count
0,2016.0,10.0,205
1,2016.0,11.0,58
2,2016.0,12.0,4
3,2017.0,1.0,283
4,2017.0,2.0,1351
5,2017.0,3.0,2382
6,2017.0,4.0,1849
7,2017.0,5.0,3751
8,2017.0,6.0,3223
9,2017.0,7.0,3455

In [ ]:
print(agg.sql())

### **Top 5 cities with most number of orders**

In [ ]:
orders = rql.dataset('OLIST.PUBLIC.ORDERS')
customers = rql.dataset('OLIST.PUBLIC.CUSTOMERS')

ord_cust = orders.join(join_table=customers,
                     join_columns={'customer_id':'customer_id'},
                     join_type='INNER',
                     join_prefix='C',
                     filters=['CUSTOMERKEY IS NOT NULL', 'ORDERDATE < CURRENT_DATE()'])

ord_cust.preview()

In [11]:
%%sql
SELECT cu.customer_state,
       cu.customer_city,
       COUNT(oi.order_id)
FROM orders AS oi
JOIN customers AS cu ON oi.customer_id = cu.customer_id
GROUP BY cu.customer_city, cu.customer_state
ORDER BY count DESC
LIMIT 5

 * postgresql://postgres:***@localhost/olist
5 rows affected.

[('SP', 'sao paulo', 15540),
 ('RJ', 'rio de janeiro', 6882),
 ('MG', 'belo horizonte', 2773),
 ('DF', 'brasilia', 2131),
 ('PR', 'curitiba', 1521)]

### **Deliveries by hour**

In [12]:
%%sql
SELECT date_part('hour', order_delivered_customer)::int AS "hour",
       COUNT(*) AS "orders_delivered"
FROM orders
WHERE order_status = 'delivered'
GROUP BY hour

 * postgresql://postgres:***@localhost/olist
25 rows affected.

[(0, 2885),
 (1, 1515),
 (2, 649),
 (3, 260),
 (4, 187),
 (5, 198),
 (6, 269),
 (7, 396),
 (8, 779),
 (9, 1196),
 (10, 1798),
 (11, 2579),
 (12, 3651),
 (13, 4561),
 (14, 5644),
 (15, 6740),
 (16, 7901),
 (17, 8775),
 (18, 9639),
 (19, 9484),
 (20, 9157),
 (21, 7627),
 (22, 6142),
 (23, 4438),
 (None, 8)]

### **Average difference between estimated and actual delivery by month**

In [13]:
%%sql
SELECT month,
       AVG(deviation_from_estimated)::real AS difference
FROM(SELECT EXTRACT(MONTH FROM order_purchase)::int AS month,
            EXTRACT('days' FROM order_estimated_delivery - order_delivered_customer)::int AS deviation_from_estimated
FROM orders
WHERE order_status = 'delivered') AS diff
GROUP BY month

 * postgresql://postgres:***@localhost/olist
12 rows affected.

[(1, 13.38496),
 (2, 9.620979),
 (3, 7.1721644),
 (4, 11.974069),
 (5, 11.7074995),
 (6, 16.024807),
 (7, 10.879737),
 (8, 9.200588),
 (9, 10.389063),
 (10, 12.356947),
 (11, 7.2666025),
 (12, 12.093943)]

### **Average difference between order and delivery time by state**

In [14]:
%%sql
SELECT delivery_time.customer_state,
       AVG(delivery_time.delivery_in_days)::real AS avg_delivery_time_days
FROM(SELECT cu.customer_state,
            EXTRACT('days' FROM od.order_delivered_customer - od.order_purchase)::int AS delivery_in_days
     FROM ORDERS AS od
     JOIN customers AS cu ON od.customer_id = cu.customer_id
     WHERE order_status = 'delivered') AS delivery_time
GROUP BY customer_state
ORDER BY avg_delivery_time_days DESC

 * postgresql://postgres:***@localhost/olist
27 rows affected.

[('RR', 28.975609),
 ('AP', 26.731344),
 ('AM', 25.986206),
 ('AL', 24.040302),
 ('PA', 23.316067),
 ('MA', 21.117155),
 ('SE', 21.02985),
 ('CE', 20.817827),
 ('AC', 20.6375),
 ('PB', 19.953579),
 ('PI', 18.993698),
 ('RO', 18.91358),
 ('BA', 18.8664),
 ('RN', 18.824894),
 ('PE', 17.965473),
 ('MT', 17.59368),
 ('TO', 17.226278),
 ('ES', 15.33183),
 ('MS', 15.191155),
 ('GO', 15.150741),
 ('RJ', 14.848583),
 ('RS', 14.819237),
 ('SC', 14.4751835),
 ('DF', 12.509134),
 ('MG', 11.542188),
 ('PR', 11.526711),
 ('SP', 8.298094)]